app/controllers/api/friends_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" != $1 AND "users"."email" != $2  [["id", 7], ["email", "bank@benmo.com"]]
---
    def index
        @friends = User.where.not(id: params[:user_id]).where.not(email: 'bank@benmo.com')