app/controllers/api/transactions_controller.rb

    def create
        @transaction = Transaction.new(transaction_params)
        @transaction.sender_id = params[:user_id]
        # @sender = current_user
        # @receiver = User.find(params[:receiver_id])

        if @transaction.save && (@transaction.sender.balance - @transaction.amount) >= 0
            sender = @transaction.sender #  in 'transaction.rb', 'belongs_to :sender' gives a function to use
            receiver = @transaction.receiver
            sender.balance -= @transaction.amount
            receiver.balance += @transaction.amount
            sender.save
            receiver.save
---
INSERT INTO "transactions" ("amount", "sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 700.0], ["sender_id", 9], ["receiver_id", 8], ["created_at", "2020-01-15 20:18:27.748069"], ["updated_at", "2020-01-15 20:18:27.748069"]]
UPDATE "transactions" SET "sender_id" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["sender_id", 13], ["updated_at", "2020-01-14 23:23:09.186695"], ["id", 8]]

    def show
        @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE (sender_id = '8' or receiver_id = '8') ORDER BY "transactions"."created_at" DESC

    def index # index calls the 'index.json.jbuilder'

        # Below retrieves the current user's transactions
        # @transactions = Transaction.where('sender_id = :id or receiver_id = :id', { id: current_user.id }).order(created_at: :desc)

        # BETTER WAY
        # Below retrieves the transactions for the selected user
        @transactions = Transaction.where('sender_id = :id or receiver_id = :id', { id: params[:user_id] }).order(created_at: :desc)
        @user = User.find(params[:user_id])
---
SELECT "transactions".* FROM "transactions" WHERE (sender_id = $1 or receiver_id = $1) ORDER BY "transactions"."created_at" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]