app/controllers/api/transactions_controller.rb

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."sender_id" = $1 LIMIT $2  [["sender_id", 12], ["LIMIT", 1]]
---
    def create
        @transaction = Transaction.new(transaction_params)
        @transaction.sender_id = params[:user_id]
        # @sender = current_user
        # @receiver = User.find(params[:receiver_id])

        if @transaction.save && (@transaction.sender.balance - @transaction.amount) >= 0
            sender = @transaction.sender #  in 'transaction.rb', 'belongs_to :sender' gives a function to use
            receiver = @transaction.receiver
            sender.balance -= @transaction.amount
            receiver.balance += @transaction.amount
            sender.save
            receiver.save


            # Twilio SMS
            client = Twilio::REST::Client.new

            client.messages.create(
                from: ENV["twilio_phone_number"],
                to: "+1#{receiver.phone_number}",
                body: "You just received $#{"%.2f" % @transaction.amount} from #{sender.first_name}!",
            )