app/models/user.rb

    def self.find_by_credentials(email, password)
        @user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "benmo@benmo.com"], ["LIMIT", 1]]

    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "MCZZnIU07tWM980SkDg3Qw"], ["updated_at", "2020-01-15 02:58:52.289525"], ["id", 13]]