app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "benmo@benmo.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        @user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "SxApe9YaBEgsAul463yYvg"], ["updated_at", "2020-01-08 05:48:18.051734"], ["id", 4]]
---
    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64
        self.save!